{
  "song_file": "brethren-we-have-met-to-worship",
  "title": "Brethren, we have met to worship",
  "tune": "HOLY MANNA",
  "meter": "87.87 D",
  "stanza_count": "4",
  "composer": "The Columbian Harmony, 1825",
  "poet": "The Columbian Harmony, 1825",
  "key": "A major",
  "date_added": "2021/01/07",
  "tags": [
    "english",
    "christian",
    "4part"
  ],
  "lyrics": "Brethren we have met to worship and adore the Lord our God.\nWill you pray with all your power while we try to preach the word?\nAll is vain unless the Spirit of the holy One comes down.\nBrethren pray, and holy manna will be showered all around.\n\nSisters, will you come and help us? Moses' sisters aided him.\nWill you help the trembling mourners who are struggling hard with sin?\nTell them all about the Savior. Tell them that he will be found.\nSisters pray, and holy manna will be showered all around.\n\nIs there here a trembling jailer, seeking grace and filled with fears?\nIs there here a weeping Mary pouring forth a flood of tears?\nBrethren join your cries to help them, sisters, let your prayers abound!\nPray, oh pray, that holy manna will be showered all around.\n\nLet us love our God supremely, let us love each other too.\nLet us love and pray for sinners till our God makes all things new.\nChrist will call us home to heaven. At his table we'll sit down.\nChrist will gird himself and serve us with sweet manna all around.\n",
  "image": "https://github.com/kenanbit/hymnsinger/releases/latest/download/brethren-we-have-met-to-worship-trad.png",
  "description": "View, play, and download the PDF sheet music, slideshow, and audio. Lyrics: Brethren we have met to worship and adore the Lord our God. Will you pray with all your power while we try to preach the word? All is vain unless the ... english christian 4part",
  "songs_with_same_tune": [
    {
      "t": "HOLY MANNA",
      "s": "God, who stretched the spangled heavens",
      "e": "https://digitalsongsandhymns.com/songs/1846"
    },
    {
      "t": "HOLY MANNA",
      "s": "All who hunger, gather gladly"
    }
  ]
}