{
  "song_file": "come-o-thou-traveller",
  "title": "Come, O thou Traveler unknown",
  "tune": "VERNON",
  "meter": "88.88.88",
  "stanza_count": "11",
  "composer": "American folk melody, 1805;\narr. Kenan Schaefkofer, 2018",
  "poet": "Charles Wesley, 1742",
  "key": "D minor",
  "date_added": "2021/01/11",
  "tags": [
    "english",
    "theist",
    "1part",
    "accompanied"
  ],
  "lyrics": "Come, O thou Traveler unknown, whom still, I hold, but cannot see!\nMy company before is gone, and I am left alone with thee.\nWith thee all night I mean to stay, and wrestle till the break of day.\n\nI need not tell thee who I am, my misery and sin declare.\nThyself has called me by my name, look on thy hands and read it there.\nBut who, I ask thee, who art thou? Tell me thy name and tell me now.\n\nIn vain thou strugglest to get free;\nI never will unloose my hold.\nArt thou the Man that died for me?\nThe secret of thy love unfold.\nWrestling, I will not let thee go,\ntill I thy name, thy nature know.\n\nWilt thou not yet to me reveal\nthy new, unutterable name?\nTell me, I still beseech thee, tell,\nto know it now resolved I am.\nWrestling, I will not let thee go,\ntill I thy name, thy nature know.\n\n'Tis all in vain to hold thy tongue\nor touch the hollow of my thigh.\nThough every sinew is unstrung,\nout of my arms thou shalt not fly.\nWrestling, I will not let thee go,\ntill I thy name, thy nature know.\n\nWhat though my shrinking flesh complain\nand murmur to contend so long,\nI rise superior to my pain;\nwhen I am weak then I am strong,\nand when my all of strength shall fail\nI shall with the God-man prevail.\n\nMy strength is gone, my nature dies,\nI sink beneath thy weighty hand,\nfaint to revive, and fall to rise.\nI fall, and yet by faith AI stand,\nI stand and will not let thee go,\ntill I thy name, thy nature know.\n\nYield to me now - for I am weak\nbut confident in self-despair!\nSpeak to my heart, in blessing speak,\nbe conquered by my instant prayer.\nSpeak, or thou never hence shalt move,\nand tell me if thy name is Love.\n\n'Tis Love! 'tis Love! thou diedst for me,\nI hear thy whisper in my heart.\nThe morning breaks, the shadows flee,\npure, universal Love thou art.\nTo me, to all, thy mercies move -\nthy nature, and thy name is Love.\n\nMy prayer hath power with God;\nthe grace unspeakable I now receive!\nThrough faith I see thee face to face,\nI see thee face to face, and live!\nIn vain I have not wept and strove -\nthy nature, and thy name is Love.\n\nContented now upon my thigh\nI halt, till life's short journey end.\nAll helplessness, all weakness I\non thee alone for strength depend,\nnor have I power from thee to move.\nThy nature, and thy name is Love!\n",
  "image": "https://github.com/kenanbit/hymnsinger/releases/latest/download/come-o-thou-traveller-trad.png",
  "description": "View, play, and download the PDF sheet music, slideshow, and audio. Lyrics: Come, O thou Traveler unknown, whom still, I hold, but cannot see! My company before is gone, and I am left alone with thee. With thee all night I mea... english theist 1part accompanied",
  "songs_with_same_tune": []
}