{
  "song_file": "fruit-of-the-whys",
  "exclude_from_index": false,
  "title": "Fruit of the Whys",
  "tune": "EXCELLENT QUESTION",
  "meter": "11.11.11.11 with refrain",
  "stanza_count": "5",
  "composer": "Kenan Schaefkofer, 2022",
  "poet": "Kenan Schaefkofer, 2022",
  "key": "F major",
  "date_added": "2022/05/12",
  "tags": [
    "english",
    "secular",
    "3part",
    "chords"
  ],
  "lyrics": "The Whys as a fam'ly seem odd at first glance,\nThey're farmers attempting to kill all their plants.\nWhen harvest day comes, after all that abuse,\nthe veggies surviving can \\hideVerseNumberAtLineStart really produce!\n\n  Oh, how do the Whys grow whatever they do?\n  An excellent question! Here's what they'll tell you:\n  We flood in the night and we burn in the day.\n  In evening and morning we're hacking away.\n  We suffer no beet leaf to stay past its prime,\n  or give tender stems just a little more time.\n  Yes, some will survive, but we know not yet which!\n  The ones that do, thrive, and have made us quite rich.\n  With respect to all farmers, regarding their crops,\n  too many collapse when the pampering stops!\n\nThe Whys sow with each seed a kernel of doubt.\nThey trust a few neighbors, but never a sprout,\ncause folk round these parts grow the darndest of things,\nbut Whys plant a seed just to test what it brings!\n\nAn oak tree, unyielding twohundred years back,\nwas finally felled after many a whack.\nYou might think it cold, but they shed not a tear.\nThe stump made a bed for new growth to appear!\n\nA guy once came by selling Magical Stalk™.\nThe Whys took one look and said, \"That's just a rock!\nUnliving, unkillable, won't give a yield.\nIt's not worth the space it would take in our field!\"\n\nTo be like the Whys, you must take things apart.\nTo challenge my story's a great place to start!\n\"If this\" herbal analogy withers and dies,\nI still think it's true you'll find truth in the Whys!\n",
  "image": "https://github.com/kenakofer/hymnsinger/releases/latest/download/fruit-of-the-whys-trad.png",
  "description": "View, play, and download the PDF sheet music, slideshow, and audio. Lyrics: The Whys as a fam'ly seem odd at first glance, They're farmers attempting to kill all their plants. When harvest day comes, after all that abuse, the ... english secular 3part chords",
  "songs_with_same_tune": []
}