{
  "song_file": "love-divine-all-loves-excelling",
  "exclude_from_index": false,
  "title": "Love divine, all loves excelling",
  "tune": "HYFRYDOL",
  "meter": "87.87 D",
  "stanza_count": "4",
  "composer": "Rowland H. Prichard ca. 1830;\narr. Ralph Vaughn Williams, 1906",
  "poet": "Charles Wesley, 1747",
  "key": "F major",
  "date_added": "2022/05/12",
  "tags": [
    "english",
    "christian",
    "4part",
    "chords"
  ],
  "lyrics": "Love divine, all loves excelling, Joy of heav'n to earth come down,\nfix in us Thy humble dwelling, all Thy faithful mercies crown!\nJesus, Thou art all compassion, pure, unbounded love Thou art;\nvisit us with Thy salvation, enter every trembling heart.\n\nBreathe, O breathe Thy loving Spirit into every troubled breast!\nLet us all in Thee inherit, let us find the promised rest;\ntake away the love of sinning; Alpha and Omega be;\nend of faith, as its beginning, set our hearts at liberty.\n\nCome, Almighty to deliver, let us all Thy life receive;\nsuddenly return, and never, nevermore Thy temples leave.\nThee we would be always blessing, serve Thee as Thy hosts above;\npray, and praise Thee without ceasing, glory in Thy perfect love.\n\nFinish, then, Thy new creation; Pure and spotless let us be;\nlet us see Thy great salvation perfectly restored in Thee;\nchanged from glory into glory, till in heav'n we take our place,\ntill we cast our crowns before Thee, lost in wonder, love, and praise.\n",
  "image": "/local-lilypond-outputs/love-divine-all-loves-excelling-trad.png",
  "description": "View, play, and download the PDF sheet music, slideshow, and audio. Lyrics: Love divine, all loves excelling, Joy of heav'n to earth come down, fix in us Thy humble dwelling, all Thy faithful mercies crown! Jesus, Thou art all... english christian 4part chords",
  "songs_with_same_tune": [
    {
      "t": "HYFRYDOL",
      "s": "Alleluia! Sing to Jesus"
    },
    {
      "t": "HYFRYDOL",
      "s": "Come, thou long-expected Jesus",
      "i": "come-thou-long-expected-jesus"
    }
  ]
}