{
  "song_file": "religion-fit-to-last",
  "exclude_from_index": false,
  "title": "Religion fit to last",
  "tune": "JESOUS AHATONHIA (adapted)",
  "meter": "86.86.76.86",
  "stanza_count": "5",
  "composer": "French folk melody;\narr. Kenan Schaefkofer, 2021",
  "poet": "Kenan Schaefkofer, 2021",
  "key": "G minor",
  "date_added": "2021/01/12",
  "tags": [
    "english",
    "secular",
    "1part",
    "accompanied"
  ],
  "lyrics": "A voice within cries out, distressed, to see you taste the fruit,\nforbidden by your God and creed, respected since your youth:\n\"Prodigal, I'll fight in you, restore your faith to thrive.\nI'll bring you back within the fold. Without you can't survive.\nWithout you can't survive!\"\n\n\"You'd loose the bond of family!\" your instinct diatribes.\nDecide: Be shunned to wilderness, or rest in harmless lies.\nAct against evolvéd traits? Your logic might agree,\nbut in your gut, you crave not truth, you crave community.\nYou crave community!\n\nIf earthly fears don't faze you, try a sample of Pascal:\nA slim chance of unfathomed bliss is worth more than your all.\nWalk along the Roman Road, elude eternal pain.\nSalvation's path is markéd well, with brimstone in the drain,\nwith brimstone in the drain:\n\nStep one: believe, O wretch, your life is worthless, justly lost,\nand second: faith's your only hope, at seemingly no cost!\nThird, since faith is proved by work, pay up in duties due:\nTwo hands on plow, and don't look back, for Brother's watching you.\nYour God is watching you!\n\nHeed not the sluggish, skeptic thought, the votes have all been cast.\nReligions of today are the religions fit to last.\nMembers true through power, fear, or friendly company\nrebuke again their wayward young, \"Eat not from yonder tree.\"\n\"Eat not from yonder tree!\"\n",
  "image": "https://github.com/kenakofer/hymnsinger/releases/latest/download/religion-fit-to-last-trad.png",
  "description": "View, play, and download the PDF sheet music, slideshow, and audio. Lyrics: A voice within cries out, distressed, to see you taste the fruit, forbidden by your God and creed, respected since your youth: \\\"Prodigal, I'll fight i... english secular 1part accompanied",
  "songs_with_same_tune": [
    {
      "t": "JESOUS AHATONHIA (adapted)",
      "s": "'Twas in the moon of wintertime",
      "e": "https://digitalsongsandhymns.com/songs/7291"
    }
  ]
}